Revit will call this method when done using the engine.
  Namespace:   Autodesk.Revit.DB.PointClouds
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
void Free()
  Visual Basic
Sub Free
  Visual C++
void Free()
 See Also
  IPointCloudEngine Interface
  Autodesk.Revit.DB.PointClouds Namespace